In [1]:
import pandas as pd
import numpy as np

In [6]:
data={
    "roll":[2,3,8,4,5],
    "paper":["a","b","c","d","e"],
    "marks":[np.nan,34,45,56,67]
}

In [7]:
df1=pd.DataFrame(data)

In [8]:
## here the marks colomn have a null value 
df1

   roll paper  marks
0     2     a    NaN
1     3     b   34.0
2     8     c   45.0
3     4     d   56.0
4     5     e   67.0

CHECKING NULL VALUES

In [10]:
## tells  weather the data have a null value or not
df1.isnull()

    roll  paper  marks
0  False  False   True
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

FILLING A NULL PLACE

In [11]:
## fills the null place with the specified value
df2=df1.fillna(50)

In [12]:
df2

   roll paper  marks
0     2     a   50.0
1     3     b   34.0
2     8     c   45.0
3     4     d   56.0
4     5     e   67.0

In [15]:
df1

   roll paper  marks
0     2     a    NaN
1     3     b   34.0
2     8     c   45.0
3     4     d   56.0
4     5     e   67.0

DROPPPING THE NULLVALUES

In [19]:
df1  ## is has the null value

   roll paper  marks
0     2     a    NaN
1     3     b   34.0
2     8     c   45.0
3     4     d   56.0
4     5     e   67.0

In [17]:
df1.dropna() ## it drops the null value row

   roll paper  marks
1     3     b   34.0
2     8     c   45.0
3     4     d   56.0
4     5     e   67.0

In [18]:
df1.dropna(axis=0)  ## .dropna() and .dropna(axis=0 )  both are same

   roll paper  marks
1     3     b   34.0
2     8     c   45.0
3     4     d   56.0
4     5     e   67.0

In [20]:
## if we wamt to drop the colomn of the null value the we can use the axis =1 
df1.dropna(axis=1)

   roll paper
0     2     a
1     3     b
2     8     c
3     4     d
4     5     e